/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {

    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());
        let mut val = 0;
        for i in 0..(bit_width as usize) {
            if self.get_bit(i + bit_offset) {
                let index = if cfg!(target_endian = "big") {
                    bit_width as usize - 1 - i
                } else {
                    i
                };
                val |= 1 << index;
            }
        }
        val
    }
    #[inline]
    pub unsafe fn raw_get(this: *const Self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < core::mem::size_of::<Storage>());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= core::mem::size_of::<Storage>());
        let mut val = 0;
        for i in 0..(bit_width as usize) {
            if Self::raw_get_bit(this, i + bit_offset) {
                let index = if cfg!(target_endian = "big") {
                    bit_width as usize - 1 - i
                } else {
                    i
                };
                val |= 1 << index;
            }
        }
        val
    }
    #[inline]
    pub fn set(&mut self, bit_offset: usize, bit_width: u8, val: u64) {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());
        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            self.set_bit(index + bit_offset, val_bit_is_set);
        }
    }
    #[inline]
    pub unsafe fn raw_set(this: *mut Self, bit_offset: usize, bit_width: u8, val: u64) {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < core::mem::size_of::<Storage>());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= core::mem::size_of::<Storage>());
        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            Self::raw_set_bit(this, index + bit_offset, val_bit_is_set);
        }
    }
}
pub const EC_END: i32 = -1;
pub const EC_MAX_SYNC_MANAGERS: u32 = 16;
pub const EC_MAX_STRING_LENGTH: u32 = 64;
pub const EC_MAX_PORTS: u32 = 4;
pub const EC_COE_EMERGENCY_MSG_SIZE: u32 = 8;
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
#[doc = " Data types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_master {
    _unused: [u8; 0],
}
pub type ec_master_t = ec_master;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_slave_config {
    _unused: [u8; 0],
}
pub type ec_slave_config_t = ec_slave_config;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_domain {
    _unused: [u8; 0],
}
pub type ec_domain_t = ec_domain;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_sdo_request {
    _unused: [u8; 0],
}
pub type ec_sdo_request_t = ec_sdo_request;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_soe_request {
    _unused: [u8; 0],
}
pub type ec_soe_request_t = ec_soe_request;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_voe_handler {
    _unused: [u8; 0],
}
pub type ec_voe_handler_t = ec_voe_handler;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_reg_request {
    _unused: [u8; 0],
}
pub type ec_reg_request_t = ec_reg_request;
#[doc = " Master state.\n\n This is used for the output parameter of ecrt_master_state().\n\n \\see ecrt_master_state()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ec_master_state_t {
    #[doc = "< Sum of responding slaves on all\nEthernet devices."]
    pub slaves_responding: ::std::os::raw::c_uint,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_master_state_t"][::std::mem::size_of::<ec_master_state_t>() - 8usize];
    ["Alignment of ec_master_state_t"][::std::mem::align_of::<ec_master_state_t>() - 4usize];
    ["Offset of field: ec_master_state_t::slaves_responding"]
        [::std::mem::offset_of!(ec_master_state_t, slaves_responding) - 0usize];
};
impl ec_master_state_t {
    #[inline]
    pub fn al_states(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_al_states(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn al_states_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_al_states_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn link_up(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_link_up(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn link_up_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_link_up_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        al_states: ::std::os::raw::c_uint,
        link_up: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let al_states: u32 = unsafe { ::std::mem::transmute(al_states) };
            al_states as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let link_up: u32 = unsafe { ::std::mem::transmute(link_up) };
            link_up as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Redundant link state.\n\n This is used for the output parameter of ecrt_master_link_state().\n\n \\see ecrt_master_link_state()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ec_master_link_state_t {
    #[doc = "< Sum of responding slaves on the given\nlink."]
    pub slaves_responding: ::std::os::raw::c_uint,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_master_link_state_t"][::std::mem::size_of::<ec_master_link_state_t>() - 8usize];
    ["Alignment of ec_master_link_state_t"]
        [::std::mem::align_of::<ec_master_link_state_t>() - 4usize];
    ["Offset of field: ec_master_link_state_t::slaves_responding"]
        [::std::mem::offset_of!(ec_master_link_state_t, slaves_responding) - 0usize];
};
impl ec_master_link_state_t {
    #[inline]
    pub fn al_states(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_al_states(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn al_states_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_al_states_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn link_up(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_link_up(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn link_up_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_link_up_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        al_states: ::std::os::raw::c_uint,
        link_up: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let al_states: u32 = unsafe { ::std::mem::transmute(al_states) };
            al_states as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let link_up: u32 = unsafe { ::std::mem::transmute(link_up) };
            link_up as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Slave configuration state.\n\n This is used as an output parameter of ecrt_slave_config_state().\n\n \\see ecrt_slave_config_state()."]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct ec_slave_config_state_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_slave_config_state_t"][::std::mem::size_of::<ec_slave_config_state_t>() - 4usize];
    ["Alignment of ec_slave_config_state_t"]
        [::std::mem::align_of::<ec_slave_config_state_t>() - 4usize];
};
impl ec_slave_config_state_t {
    #[inline]
    pub fn online(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_online(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn online_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_online_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn operational(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_operational(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn operational_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_operational_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn al_state(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_al_state(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn al_state_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_al_state_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        online: ::std::os::raw::c_uint,
        operational: ::std::os::raw::c_uint,
        al_state: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let online: u32 = unsafe { ::std::mem::transmute(online) };
            online as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let operational: u32 = unsafe { ::std::mem::transmute(operational) };
            operational as u64
        });
        __bindgen_bitfield_unit.set(2usize, 4u8, {
            let al_state: u32 = unsafe { ::std::mem::transmute(al_state) };
            al_state as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Master information.\n\n This is used as an output parameter of ecrt_master().\n\n \\see ecrt_master()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ec_master_info_t {
    #[doc = "< Number of slaves in the network."]
    pub slave_count: ::std::os::raw::c_uint,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "< \\a true, while the master is scanning the network."]
    pub scan_busy: u8,
    #[doc = "< Application time."]
    pub app_time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_master_info_t"][::std::mem::size_of::<ec_master_info_t>() - 16usize];
    ["Alignment of ec_master_info_t"][::std::mem::align_of::<ec_master_info_t>() - 8usize];
    ["Offset of field: ec_master_info_t::slave_count"]
        [::std::mem::offset_of!(ec_master_info_t, slave_count) - 0usize];
    ["Offset of field: ec_master_info_t::scan_busy"]
        [::std::mem::offset_of!(ec_master_info_t, scan_busy) - 5usize];
    ["Offset of field: ec_master_info_t::app_time"]
        [::std::mem::offset_of!(ec_master_info_t, app_time) - 8usize];
};
impl ec_master_info_t {
    #[inline]
    pub fn link_up(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_link_up(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn link_up_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_link_up_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(link_up: ::std::os::raw::c_uint) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let link_up: u32 = unsafe { ::std::mem::transmute(link_up) };
            link_up as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Master scan progress information.\n\n This is used as an output parameter of ecrt_master_scan_progress().\n\n \\see ecrt_master_scan_progress()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ec_master_scan_progress_t {
    #[doc = "< Number of slaves detected."]
    pub slave_count: ::std::os::raw::c_uint,
    #[doc = "< Index of the slave that is currently\nscanned.  If it is less than the \\a\nslave_count, the network scan is in progress."]
    pub scan_index: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_master_scan_progress_t"]
        [::std::mem::size_of::<ec_master_scan_progress_t>() - 8usize];
    ["Alignment of ec_master_scan_progress_t"]
        [::std::mem::align_of::<ec_master_scan_progress_t>() - 4usize];
    ["Offset of field: ec_master_scan_progress_t::slave_count"]
        [::std::mem::offset_of!(ec_master_scan_progress_t, slave_count) - 0usize];
    ["Offset of field: ec_master_scan_progress_t::scan_index"]
        [::std::mem::offset_of!(ec_master_scan_progress_t, scan_index) - 4usize];
};
#[repr(u32)]
#[doc = " EtherCAT slave port descriptor."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ec_slave_port_desc_t {
    #[doc = "< Port is not implemented."]
    EC_PORT_NOT_IMPLEMENTED = 0,
    #[doc = "< Port is not configured."]
    EC_PORT_NOT_CONFIGURED = 1,
    #[doc = "< Port is an E-Bus."]
    EC_PORT_EBUS = 2,
    #[doc = "< Port is a MII."]
    EC_PORT_MII = 3,
}
#[doc = " EtherCAT slave port information."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ec_slave_port_link_t {
    #[doc = "< Link detected."]
    pub link_up: u8,
    #[doc = "< Loop closed."]
    pub loop_closed: u8,
    #[doc = "< Detected signal on RX port."]
    pub signal_detected: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_slave_port_link_t"][::std::mem::size_of::<ec_slave_port_link_t>() - 3usize];
    ["Alignment of ec_slave_port_link_t"][::std::mem::align_of::<ec_slave_port_link_t>() - 1usize];
    ["Offset of field: ec_slave_port_link_t::link_up"]
        [::std::mem::offset_of!(ec_slave_port_link_t, link_up) - 0usize];
    ["Offset of field: ec_slave_port_link_t::loop_closed"]
        [::std::mem::offset_of!(ec_slave_port_link_t, loop_closed) - 1usize];
    ["Offset of field: ec_slave_port_link_t::signal_detected"]
        [::std::mem::offset_of!(ec_slave_port_link_t, signal_detected) - 2usize];
};
#[doc = " Slave information.\n\n This is used as an output parameter of ecrt_master_get_slave().\n\n \\see ecrt_master_get_slave()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_slave_info_t {
    #[doc = "< Offset of the slave in the ring."]
    pub position: u16,
    #[doc = "< Vendor-ID stored on the slave."]
    pub vendor_id: u32,
    #[doc = "< Product-Code stored on the slave."]
    pub product_code: u32,
    #[doc = "< Revision-Number stored on the slave."]
    pub revision_number: u32,
    #[doc = "< Serial-Number stored on the slave."]
    pub serial_number: u32,
    #[doc = "< The slaves alias if not equal to 0."]
    pub alias: u16,
    #[doc = "< Used current in mA."]
    pub current_on_ebus: i16,
    #[doc = "< Port information."]
    pub ports: [ec_slave_info_t__bindgen_ty_1; 4usize],
    #[doc = "< Current state of the slave."]
    pub al_state: u8,
    #[doc = "< Error flag for that slave."]
    pub error_flag: u8,
    #[doc = "< Number of sync managers."]
    pub sync_count: u8,
    #[doc = "< Number of SDOs."]
    pub sdo_count: u16,
    #[doc = "< Name of the slave."]
    pub name: [::std::os::raw::c_char; 64usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_slave_info_t__bindgen_ty_1 {
    #[doc = "< Physical port type."]
    pub desc: ec_slave_port_desc_t,
    #[doc = "< Port link state."]
    pub link: ec_slave_port_link_t,
    #[doc = "< Receive time on DC transmission delay\nmeasurement."]
    pub receive_time: u32,
    #[doc = "< Ring position of next DC slave on that\nport."]
    pub next_slave: u16,
    #[doc = "< Delay [ns] to next DC slave."]
    pub delay_to_next_dc: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_slave_info_t__bindgen_ty_1"]
        [::std::mem::size_of::<ec_slave_info_t__bindgen_ty_1>() - 20usize];
    ["Alignment of ec_slave_info_t__bindgen_ty_1"]
        [::std::mem::align_of::<ec_slave_info_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: ec_slave_info_t__bindgen_ty_1::desc"]
        [::std::mem::offset_of!(ec_slave_info_t__bindgen_ty_1, desc) - 0usize];
    ["Offset of field: ec_slave_info_t__bindgen_ty_1::link"]
        [::std::mem::offset_of!(ec_slave_info_t__bindgen_ty_1, link) - 4usize];
    ["Offset of field: ec_slave_info_t__bindgen_ty_1::receive_time"]
        [::std::mem::offset_of!(ec_slave_info_t__bindgen_ty_1, receive_time) - 8usize];
    ["Offset of field: ec_slave_info_t__bindgen_ty_1::next_slave"]
        [::std::mem::offset_of!(ec_slave_info_t__bindgen_ty_1, next_slave) - 12usize];
    ["Offset of field: ec_slave_info_t__bindgen_ty_1::delay_to_next_dc"]
        [::std::mem::offset_of!(ec_slave_info_t__bindgen_ty_1, delay_to_next_dc) - 16usize];
};
impl Default for ec_slave_info_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_slave_info_t"][::std::mem::size_of::<ec_slave_info_t>() - 176usize];
    ["Alignment of ec_slave_info_t"][::std::mem::align_of::<ec_slave_info_t>() - 4usize];
    ["Offset of field: ec_slave_info_t::position"]
        [::std::mem::offset_of!(ec_slave_info_t, position) - 0usize];
    ["Offset of field: ec_slave_info_t::vendor_id"]
        [::std::mem::offset_of!(ec_slave_info_t, vendor_id) - 4usize];
    ["Offset of field: ec_slave_info_t::product_code"]
        [::std::mem::offset_of!(ec_slave_info_t, product_code) - 8usize];
    ["Offset of field: ec_slave_info_t::revision_number"]
        [::std::mem::offset_of!(ec_slave_info_t, revision_number) - 12usize];
    ["Offset of field: ec_slave_info_t::serial_number"]
        [::std::mem::offset_of!(ec_slave_info_t, serial_number) - 16usize];
    ["Offset of field: ec_slave_info_t::alias"]
        [::std::mem::offset_of!(ec_slave_info_t, alias) - 20usize];
    ["Offset of field: ec_slave_info_t::current_on_ebus"]
        [::std::mem::offset_of!(ec_slave_info_t, current_on_ebus) - 22usize];
    ["Offset of field: ec_slave_info_t::ports"]
        [::std::mem::offset_of!(ec_slave_info_t, ports) - 24usize];
    ["Offset of field: ec_slave_info_t::al_state"]
        [::std::mem::offset_of!(ec_slave_info_t, al_state) - 104usize];
    ["Offset of field: ec_slave_info_t::error_flag"]
        [::std::mem::offset_of!(ec_slave_info_t, error_flag) - 105usize];
    ["Offset of field: ec_slave_info_t::sync_count"]
        [::std::mem::offset_of!(ec_slave_info_t, sync_count) - 106usize];
    ["Offset of field: ec_slave_info_t::sdo_count"]
        [::std::mem::offset_of!(ec_slave_info_t, sdo_count) - 108usize];
    ["Offset of field: ec_slave_info_t::name"]
        [::std::mem::offset_of!(ec_slave_info_t, name) - 110usize];
};
impl Default for ec_slave_info_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[doc = " Domain working counter interpretation.\n\n This is used in ec_domain_state_t."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ec_wc_state_t {
    #[doc = "< No registered process data were exchanged."]
    EC_WC_ZERO = 0,
    #[doc = "< Some of the registered process data were\nexchanged."]
    EC_WC_INCOMPLETE = 1,
    #[doc = "< All registered process data were exchanged."]
    EC_WC_COMPLETE = 2,
}
#[doc = " Domain state.\n\n This is used for the output parameter of ecrt_domain_state()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_domain_state_t {
    #[doc = "< Value of the last working counter."]
    pub working_counter: ::std::os::raw::c_uint,
    #[doc = "< Working counter interpretation."]
    pub wc_state: ec_wc_state_t,
    #[doc = "< Redundant link is in use."]
    pub redundancy_active: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_domain_state_t"][::std::mem::size_of::<ec_domain_state_t>() - 12usize];
    ["Alignment of ec_domain_state_t"][::std::mem::align_of::<ec_domain_state_t>() - 4usize];
    ["Offset of field: ec_domain_state_t::working_counter"]
        [::std::mem::offset_of!(ec_domain_state_t, working_counter) - 0usize];
    ["Offset of field: ec_domain_state_t::wc_state"]
        [::std::mem::offset_of!(ec_domain_state_t, wc_state) - 4usize];
    ["Offset of field: ec_domain_state_t::redundancy_active"]
        [::std::mem::offset_of!(ec_domain_state_t, redundancy_active) - 8usize];
};
impl Default for ec_domain_state_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[doc = " Direction type for PDO assignment functions."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ec_direction_t {
    #[doc = "< Invalid direction. Do not use this value."]
    EC_DIR_INVALID = 0,
    #[doc = "< Values written by the master."]
    EC_DIR_OUTPUT = 1,
    #[doc = "< Values read by the master."]
    EC_DIR_INPUT = 2,
    #[doc = "< Number of directions. For internal use only."]
    EC_DIR_COUNT = 3,
}
#[repr(u32)]
#[doc = " Watchdog mode for sync manager configuration.\n\n Used to specify, if a sync manager's watchdog is to be enabled."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ec_watchdog_mode_t {
    #[doc = "< Use the default setting of the sync manager."]
    EC_WD_DEFAULT = 0,
    #[doc = "< Enable the watchdog."]
    EC_WD_ENABLE = 1,
    #[doc = "< Disable the watchdog."]
    EC_WD_DISABLE = 2,
}
#[doc = " PDO entry configuration information.\n\n This is the data type of the \\a entries field in ec_pdo_info_t.\n\n \\see ecrt_slave_config_pdos()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ec_pdo_entry_info_t {
    #[doc = "< PDO entry index."]
    pub index: u16,
    #[doc = "< PDO entry subindex."]
    pub subindex: u8,
    #[doc = "< Size of the PDO entry in bit."]
    pub bit_length: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_pdo_entry_info_t"][::std::mem::size_of::<ec_pdo_entry_info_t>() - 4usize];
    ["Alignment of ec_pdo_entry_info_t"][::std::mem::align_of::<ec_pdo_entry_info_t>() - 2usize];
    ["Offset of field: ec_pdo_entry_info_t::index"]
        [::std::mem::offset_of!(ec_pdo_entry_info_t, index) - 0usize];
    ["Offset of field: ec_pdo_entry_info_t::subindex"]
        [::std::mem::offset_of!(ec_pdo_entry_info_t, subindex) - 2usize];
    ["Offset of field: ec_pdo_entry_info_t::bit_length"]
        [::std::mem::offset_of!(ec_pdo_entry_info_t, bit_length) - 3usize];
};
#[doc = " PDO configuration information.\n\n This is the data type of the \\a pdos field in ec_sync_info_t.\n\n \\see ecrt_slave_config_pdos()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_pdo_info_t {
    #[doc = "< PDO index."]
    pub index: u16,
    #[doc = "< Number of PDO entries in \\a entries to map.\nZero means, that the default mapping shall be\nused (this can only be done if the slave is\npresent at configuration time)."]
    pub n_entries: ::std::os::raw::c_uint,
    #[doc = "< Array of PDO entries to map. Can\neither be \\a NULL, or must contain\nat least \\a n_entries values."]
    pub entries: *const ec_pdo_entry_info_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_pdo_info_t"][::std::mem::size_of::<ec_pdo_info_t>() - 16usize];
    ["Alignment of ec_pdo_info_t"][::std::mem::align_of::<ec_pdo_info_t>() - 8usize];
    ["Offset of field: ec_pdo_info_t::index"]
        [::std::mem::offset_of!(ec_pdo_info_t, index) - 0usize];
    ["Offset of field: ec_pdo_info_t::n_entries"]
        [::std::mem::offset_of!(ec_pdo_info_t, n_entries) - 4usize];
    ["Offset of field: ec_pdo_info_t::entries"]
        [::std::mem::offset_of!(ec_pdo_info_t, entries) - 8usize];
};
impl Default for ec_pdo_info_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Sync manager configuration information.\n\n This can be use to configure multiple sync managers including the PDO\n assignment and PDO mapping. It is used as an input parameter type in\n ecrt_slave_config_pdos()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_sync_info_t {
    #[doc = "< Sync manager index. Must be less\nthan #EC_MAX_SYNC_MANAGERS for a valid sync manager,\nbut can also be \\a 0xff to mark the end of the list."]
    pub index: u8,
    #[doc = "< Sync manager direction."]
    pub dir: ec_direction_t,
    #[doc = "< Number of PDOs in \\a pdos."]
    pub n_pdos: ::std::os::raw::c_uint,
    #[doc = "< Array with PDOs to assign. This must\ncontain at least \\a n_pdos PDOs."]
    pub pdos: *const ec_pdo_info_t,
    #[doc = "< Watchdog mode."]
    pub watchdog_mode: ec_watchdog_mode_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_sync_info_t"][::std::mem::size_of::<ec_sync_info_t>() - 32usize];
    ["Alignment of ec_sync_info_t"][::std::mem::align_of::<ec_sync_info_t>() - 8usize];
    ["Offset of field: ec_sync_info_t::index"]
        [::std::mem::offset_of!(ec_sync_info_t, index) - 0usize];
    ["Offset of field: ec_sync_info_t::dir"][::std::mem::offset_of!(ec_sync_info_t, dir) - 4usize];
    ["Offset of field: ec_sync_info_t::n_pdos"]
        [::std::mem::offset_of!(ec_sync_info_t, n_pdos) - 8usize];
    ["Offset of field: ec_sync_info_t::pdos"]
        [::std::mem::offset_of!(ec_sync_info_t, pdos) - 16usize];
    ["Offset of field: ec_sync_info_t::watchdog_mode"]
        [::std::mem::offset_of!(ec_sync_info_t, watchdog_mode) - 24usize];
};
impl Default for ec_sync_info_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " List record type for PDO entry mass-registration.\n\n This type is used for the array parameter of the\n ecrt_domain_reg_pdo_entry_list()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_pdo_entry_reg_t {
    #[doc = "< Slave alias address."]
    pub alias: u16,
    #[doc = "< Slave position."]
    pub position: u16,
    #[doc = "< Slave vendor ID."]
    pub vendor_id: u32,
    #[doc = "< Slave product code."]
    pub product_code: u32,
    #[doc = "< PDO entry index."]
    pub index: u16,
    #[doc = "< PDO entry subindex."]
    pub subindex: u8,
    #[doc = "< Pointer to a variable to store the PDO entry's\n(byte-)offset in the process data."]
    pub offset: *mut ::std::os::raw::c_uint,
    #[doc = "< Pointer to a variable to store a bit\nposition (0-7) within the \\a offset. Can be\nNULL, in which case an error is raised if\nthe PDO entry does not byte-align."]
    pub bit_position: *mut ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ec_pdo_entry_reg_t"][::std::mem::size_of::<ec_pdo_entry_reg_t>() - 32usize];
    ["Alignment of ec_pdo_entry_reg_t"][::std::mem::align_of::<ec_pdo_entry_reg_t>() - 8usize];
    ["Offset of field: ec_pdo_entry_reg_t::alias"]
        [::std::mem::offset_of!(ec_pdo_entry_reg_t, alias) - 0usize];
    ["Offset of field: ec_pdo_entry_reg_t::position"]
        [::std::mem::offset_of!(ec_pdo_entry_reg_t, position) - 2usize];
    ["Offset of field: ec_pdo_entry_reg_t::vendor_id"]
        [::std::mem::offset_of!(ec_pdo_entry_reg_t, vendor_id) - 4usize];
    ["Offset of field: ec_pdo_entry_reg_t::product_code"]
        [::std::mem::offset_of!(ec_pdo_entry_reg_t, product_code) - 8usize];
    ["Offset of field: ec_pdo_entry_reg_t::index"]
        [::std::mem::offset_of!(ec_pdo_entry_reg_t, index) - 12usize];
    ["Offset of field: ec_pdo_entry_reg_t::subindex"]
        [::std::mem::offset_of!(ec_pdo_entry_reg_t, subindex) - 14usize];
    ["Offset of field: ec_pdo_entry_reg_t::offset"]
        [::std::mem::offset_of!(ec_pdo_entry_reg_t, offset) - 16usize];
    ["Offset of field: ec_pdo_entry_reg_t::bit_position"]
        [::std::mem::offset_of!(ec_pdo_entry_reg_t, bit_position) - 24usize];
};
impl Default for ec_pdo_entry_reg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[doc = " Request state.\n\n This is used as return type for ecrt_sdo_request_state() and\n ecrt_voe_handler_state()."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ec_request_state_t {
    #[doc = "< Not requested."]
    EC_REQUEST_UNUSED = 0,
    #[doc = "< Request is being processed."]
    EC_REQUEST_BUSY = 1,
    #[doc = "< Request was processed successfully."]
    EC_REQUEST_SUCCESS = 2,
    #[doc = "< Request processing failed."]
    EC_REQUEST_ERROR = 3,
}
#[repr(u32)]
#[doc = " Application-layer state."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
